---
kind: method
id: M:Autodesk.Revit.DB.FilteredWorksetCollector.GetEnumerator
source: html/a8713eca-87d6-bf73-fb75-495f7dac5ea7.htm
---
# Autodesk.Revit.DB.FilteredWorksetCollector.GetEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
public virtual IEnumerator<Workset> GetEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.